In [ ]:
pip install --upgrade google-api-python-client

In [ ]:
pip install --upgrade google-auth-httplib2

In [ ]:
pip install --upgrade google-auth-oauthlib

In [ ]:
pip install gspread

In [ ]:
pip install pandas

In [ ]:
pip install PyMySQL

In [ ]:
mkdir ~/.config/gspread

In [ ]:
mv ~/Downloads/instant-avatar-256201-0dd726aa3282.json ~/.config/gspread/service_account.json

In [2]:
import gspread
import pandas as pd

In [17]:
import pymysql.cursors

In [192]:
service_account = gspread.service_account(filename="/Users/timal/.config/gspread/service_account.json")

In [193]:
sheet = service_account.open("Annual_GDP")

In [194]:
work_sheet = sheet.worksheet("Annual")

In [196]:
all_values = work_sheet.get_all_values()

In [197]:
df = pd.DataFrame(all_values)

In [198]:
column_names = df.loc[6:6:].values.tolist()[0]

In [199]:
column_names.pop(0) # remmove empty column
column_names.pop(2) # remove 'Base Year' field as it is empty

'Base Year'

In [200]:
# column_names
prefix = 'year_'

for i, column in enumerate(column_names, start=2):
    column_names[i] = prefix + column_names[i]

IndexError: list index out of range

In [221]:
column_names[0] = 'country'
column_names[1] = 'scale'
column_names

['country',
 'scale',
 'year_1950',
 'year_1951',
 'year_1952',
 'year_1953',
 'year_1954',
 'year_1955',
 'year_1956',
 'year_1957',
 'year_1958',
 'year_1959',
 'year_1960',
 'year_1961',
 'year_1962',
 'year_1963',
 'year_1964',
 'year_1965',
 'year_1966',
 'year_1967',
 'year_1968',
 'year_1969',
 'year_1970',
 'year_1971',
 'year_1972',
 'year_1973',
 'year_1974',
 'year_1975',
 'year_1976',
 'year_1977',
 'year_1978',
 'year_1979',
 'year_1980',
 'year_1981',
 'year_1982',
 'year_1983',
 'year_1984',
 'year_1985',
 'year_1986',
 'year_1987',
 'year_1988',
 'year_1989',
 'year_1990',
 'year_1991',
 'year_1992',
 'year_1993',
 'year_1994',
 'year_1995',
 'year_1996',
 'year_1997',
 'year_1998',
 'year_1999',
 'year_2000',
 'year_2001',
 'year_2002',
 'year_2003',
 'year_2004',
 'year_2005',
 'year_2006',
 'year_2007',
 'year_2008',
 'year_2009',
 'year_2010',
 'year_2011',
 'year_2012',
 'year_2013',
 'year_2014',
 'year_2015',
 'year_2016',
 'year_2017',
 'year_2018',
 'year_2019',
 'year_2020',
 'year_2021']

In [222]:
us_annual_gdp = df.loc[196:196:].values.tolist()[0]
us_annual_gdp.pop(0) # remove empty first value

''

In [223]:
us_annual_gdp.pop(2) #remove empty 'Base Year' value

''

In [224]:
len(column_names)

74

In [238]:
# column_datatypes= ['VARCHAR(80)] * 74

In [240]:
# column_datatypes

In [226]:
cleaned_df = pd.DataFrame(columns=column_names)

In [227]:
cleaned_df.loc[len(cleaned_df)] = us_annual_gdp

In [228]:
cleaned_df.drop(cleaned_df.index[0])

Empty DataFrame
Columns: [country, scale, year_1950, year_1951, year_1952, year_1953, year_1954, year_1955, year_1956, year_1957, year_1958, year_1959, year_1960, year_1961, year_1962, year_1963, year_1964, year_1965, year_1966, year_1967, year_1968, year_1969, year_1970, year_1971, year_1972, year_1973, year_1974, year_1975, year_1976, year_1977, year_1978, year_1979, year_1980, year_1981, year_1982, year_1983, year_1984, year_1985, year_1986, year_1987, year_1988, year_1989, year_1990, year_1991, year_1992, year_1993, year_1994, year_1995, year_1996, year_1997, year_1998, year_1999, year_2000, year_2001, year_2002, year_2003, year_2004, year_2005, year_2006, year_2007, year_2008, year_2009, year_2010, year_2011, year_2012, year_2013, year_2014, year_2015, year_2016, year_2017, year_2018, year_2019, year_2020, year_2021]
Index: []

[0 rows x 74 columns]

In [229]:
cleaned_df

,country,scale,year_1950,year_1951,year_1952,year_1953,year_1954,year_1955,year_1956,year_1957,...,year_2012,year_2013,year_2014,year_2015,year_2016,year_2017,year_2018,year_2019,year_2020,year_2021
0,United States,Millions,"299,827.30","346,913.30","367,340.80","389,217.50","390,549.00","425,479.50","449,352.50","474,039.50",...,"16,253,970.00","16,843,195.80","17,550,687.80","18,206,023.50","18,695,105.80","19,479,622.50","20,527,158.80","21,372,582.30","20,893,745.50","22,996,086.00"

In [178]:
row = cleaned_df.loc[0:0].values.tolist()[0]
for i, entry in enumerate(row):
    if i>=2:
        row[i] = float(row[i].replace(',', ''))

In [254]:
row

['United States',
 'Millions',
 299827.3,
 346913.3,
 367340.8,
 389217.5,
 390549.0,
 425479.5,
 449352.5,
 474039.5,
 481228.5,
 521654.3,
 542382.3,
 562209.8,
 603921.5,
 637451.5,
 684461.5,
 742290.3,
 813413.8,
 859956.3,
 940646.5,
 1017615.0,
 1073310.5,
 1164849.8,
 1279112.0,
 1425376.0,
 1545242.5,
 1684905.0,
 1873412.5,
 2081825.0,
 2351598.8,
 2627326.3,
 2857308.5,
 3207041.3,
 3343789.3,
 3634036.5,
 4037614.0,
 4338980.5,
 4579632.5,
 4855216.3,
 5236438.0,
 5641579.5,
 5963144.5,
 6158129.3,
 6520327.3,
 6858558.5,
 7287236.5,
 7639749.3,
 8073121.8,
 8577552.5,
 9062816.8,
 9631171.8,
 10250952.0,
 10581929.0,
 10929108.3,
 11456449.5,
 12217195.8,
 13039197.0,
 13815583.0,
 14474227.0,
 14769861.5,
 14478066.8,
 15048970.0,
 15599731.8,
 16253970.0,
 16843195.8,
 17550687.8,
 18206023.5,
 18695105.8,
 19479622.5,
 20527158.8,
 21372582.3,
 20893745.5,
 22996086.0]

In [180]:
type(row[-1])

float

In [182]:
# Connect to MySQL database

In [260]:
mysql_connection = pymysql.connect(host='localhost',
                                   user='root',
                                   password='root',
                                   db='macro_data',
                                   cursorclass=pymysql.cursors.DictCursor)

In [261]:
table_name = 'country_annual_gdp'

In [253]:
with mysql_connection:
    with mysql_connection.cursor() as cursor:
        
        create_statement = 'CREATE TABLE ' + table_name + '('
        i = 0

        while i < len(column_names) - 1:
            create_statement = create_statement + column_names[i] + ' DECIMAL(18,2), '       
            i = i + 1

        create_statement = create_statement + column_names[i] + ' DECIMAL(18,2) )'

            
        cursor.execute(create_statement)

In [256]:
# create_statement

In [237]:
# column_names

In [262]:
with mysql_connection:
    with mysql_connection.cursor() as cursor:
        
        insert_statement = 'INSERT INTO ' + table_name + '('

        i = 0

        while i < len(column_names) - 1:

            insert_statement = insert_statement + column_names[i] +', '
            i=i+1

        insert_statement = insert_statement + column_names[i] +')'
        # print(insert_statement)

        #         cursor.execute(create_statement)

        insert_statement = insert_statement + " VALUES ("

        for i in range(74):
            insert_statement = insert_statement + "%s,"

        insert_statement = insert_statement[:-1]
        insert_statement = insert_statement + ')'
        
        cursor.execute(insert_statement, row)
        mysql_connection.commit()
        
        # print(insert_statement)

ProgrammingError: (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'CREAT TABLE country_annual_gdp(Country BIGINT(40), Scale BIGINT(40), year_1950 B' at line 1")

In [191]:
print(create_statement)

CREAT TABLE country_annual_gdp(Country BIGINT(40), Scale BIGINT(40), year_1950 BIGINT(40), year_1951 BIGINT(40), year_1952 BIGINT(40), year_1953 BIGINT(40), year_1954 BIGINT(40), year_1955 BIGINT(40), year_1956 BIGINT(40), year_1957 BIGINT(40), year_1958 BIGINT(40), year_1959 BIGINT(40), year_1960 BIGINT(40), year_1961 BIGINT(40), year_1962 BIGINT(40), year_1963 BIGINT(40), year_1964 BIGINT(40), year_1965 BIGINT(40), year_1966 BIGINT(40), year_1967 BIGINT(40), year_1968 BIGINT(40), year_1969 BIGINT(40), year_1970 BIGINT(40), year_1971 BIGINT(40), year_1972 BIGINT(40), year_1973 BIGINT(40), year_1974 BIGINT(40), year_1975 BIGINT(40), year_1976 BIGINT(40), year_1977 BIGINT(40), year_1978 BIGINT(40), year_1979 BIGINT(40), year_1980 BIGINT(40), year_1981 BIGINT(40), year_1982 BIGINT(40), year_1983 BIGINT(40), year_1984 BIGINT(40), year_1985 BIGINT(40), year_1986 BIGINT(40), year_1987 BIGINT(40), year_1988 BIGINT(40), year_1989 BIGINT(40), year_1990 BIGINT(40), year_1991 BIGINT(40), year_1992 BIGINT(40), year_1993 BIGINT(40), year_1994 BIGINT(40), year_1995 BIGINT(40), year_1996 BIGINT(40), year_1997 BIGINT(40), year_1998 BIGINT(40), year_1999 BIGINT(40), year_2000 BIGINT(40), year_2001 BIGINT(40), year_2002 BIGINT(40), year_2003 BIGINT(40), year_2004 BIGINT(40), year_2005 BIGINT(40), year_2006 BIGINT(40), year_2007 BIGINT(40), year_2008 BIGINT(40), year_2009 BIGINT(40), year_2010 BIGINT(40), year_2011 BIGINT(40), year_2012 BIGINT(40), year_2013 BIGINT(40), year_2014 BIGINT(40), year_2015 BIGINT(40), year_2016 BIGINT(40), year_2017 BIGINT(40), year_2018 BIGINT(40), year_2019 BIGINT(40), year_2020 BIGINT(40), year_2021 BIGINT(40))